## first inspection and handling of inconsistent data

In [1]:
import pandas as pd

C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\_distributor_init.py:32: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.NOIJJG62EMASZI6NYURL6JBKM4EVBGM7.gfortran-win_amd64.dll
C:\Users\drudi\Anaconda3\envs\learn-env\lib\site-packages\numpy\.libs\libopenblas.PYQHXLVVQ7VESDPUVUADXEVJOBGHJPAY.gfortran-win_amd64.dll
  stacklevel=1)

In [2]:
titanic = pd.read_csv('titanic_imp.csv')

In [3]:
titanic.head()

  Survived  Class  Gender   Age  SibSip  ParCh      Fare Emb Deck
0        0      3    male  22.0       1      0     $7.25   S  NaN
1        1      1  female  38.0       1      0  $71.2833   C    C
2        1      3  female  26.0       0      0    $7.925   S  NaN
3        1      1  female  35.0       1      0     $53.1   S    C
4        0      3    male  35.0       0      0     $8.05   S  NaN

In [4]:
titanic.tail()

    Survived  Class Gender   Age  SibSip  ParCh     Fare Emb Deck
889        1      1   male  26.0       0      0    $30.0   C    C
890        0      3   male  32.0       0      0    $7.75   Q  NaN
891        0      2   male  24.0       0      0    $10.5   S  NaN
892        0      3   male  34.0       1      1    $14.4   S  NaN
893        0      3   male  36.0       0      0  $7.8958   S  NaN

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 894 entries, 0 to 893
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  894 non-null    object
 1   Class     894 non-null    int64
 2   Gender    894 non-null    object
 3   Age       758 non-null    object
 4   SibSip    894 non-null    int64
 5   ParCh     894 non-null    int64
 6   Fare      894 non-null    object
 7   Emb       892 non-null    object
 8   Deck      203 non-null    object
dtypes: int64(3), object(6)
memory usage: 63.0+ KB

In [6]:
titanic.describe()

            Class      SibSip       ParCh
count  894.000000  894.000000  894.000000
mean     2.309843    0.522371    0.381432
std      0.835370    1.101283    0.805171
min      1.000000    0.000000    0.000000
25%      2.000000    0.000000    0.000000
50%      3.000000    0.000000    0.000000
75%      3.000000    1.000000    0.000000
max      3.000000    8.000000    6.000000

In [7]:
titanic[['Survived', 'Gender', 'Age', 'Fare', 'Emb', 'Deck']].describe()

       Survived Gender           Age   Fare  Emb Deck
count       894    894           758    894  892  203
unique        4      2            92    248    3    7
top           0   male  Missing Data  $8.05    S    C
freq        551    580            41     43  647   59

In [8]:
titanic.Survived.unique()

array(['0', '1', 'yes', 'no'], dtype=object)

In [9]:
titanic.Survived.value_counts()

0      551
1      341
yes      1
no       1
Name: Survived, dtype: int64

In [10]:
titanic.Survived.replace(to_replace=['yes', 'no'], value=[1, 2], inplace=True)

In [11]:
titanic.Survived.value_counts()

0    551
1    341
2      1
1      1
Name: Survived, dtype: int64

In [12]:
summer = pd.read_csv('summer_imp.csv')

In [13]:
summer

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold Medal
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31165,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31166,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31167,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31168,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31169,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [14]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31170 entries, 0 to 31169
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Year          31170 non-null  int64
 1   City          31170 non-null  object
 2   Sport         31170 non-null  object
 3   Discipline    31170 non-null  object
 4   Athlete Name  31170 non-null  object
 5   Country       31166 non-null  object
 6   Gender        31170 non-null  object
 7   Event         31170 non-null  object
 8   Medal         31170 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [15]:
summer.rename(columns={'Athlete Name': 'Athlete_Name'}, inplace=True)

In [16]:
summer.head()

,Year,City,Sport,Discipline,Athlete_Name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold Medal
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [17]:
summer.Medal.value_counts()

Gold          10483
Bronze        10372
Silver        10311
Gold Medal        4
Name: Medal, dtype: int64

In [18]:
summer.Medal.replace(to_replace='Gold Medal', value='Gold', inplace=True)

In [19]:
summer.Medal.value_counts()

Gold      10487
Bronze    10372
Silver    10311
Name: Medal, dtype: int64

In [20]:
summer.iloc[:, 1:].describe()

,City,Sport,Discipline,Athlete_Name,Country,Gender,Event,Medal
count,31170,31170,31170,31170,31166,31170,31170,31170
unique,22,43,67,22763,147,2,666,3
top,London,Aquatics,Athletics,"PHELPS, Michael",USA,Men,Football,Gold
freq,3567,4170,3639,22,4586,22751,1497,10487